'''
    Дано целое, положительное, трёхзначное число. Например: 123, 867, 374. Необходимо его перевернуть. Например,
    если ввели число 123, то должно получиться на выходе ЧИСЛО 321.
'''

x = input('Введите целое трехзначное число')

print (x[::-1])